# Add extra sources via `brew tap`
#
# Heroku CLI (hosting)
tap "heroku/brew"
# Homebrew itself
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Install via `brew install`
#
# `cat` alternative with syntax highlighting
brew "bat"
# Fuzzy finder
brew "fzf"
# Heroku CLI (hosting access)
brew "heroku"
# Version control
brew "git"
# Better diffing
brew "git-delta"
# Node.js version management
brew "nvm"
# Install standalone Python apps
brew "pipx"
# Python versoin management
brew "pyenv"
brew "pyenv-virtualenv"
# Remote file transfer
brew "rsync"
# File search
brew "the_silver_searcher"
# File editing
brew "vim"

# Install apps via `brew install --cask`
#
# Flash cards learning
cask "anki"
# Two factor authentication
cask "authy"
# Menu item management
cask "bartender"
# Database GUI
cask "dbeaver-community"
# Virtual dev machines
cask "docker"
# Design
cask "figma"
# Dev browser
cask "firefox"
# Screen dimming based on daylight
cask "flux"
# Finances
cask "gnucash"
# iPhone access and backups
cask "imazing"
# Image optization
cask "imageoptim"
# IDE
cask "pycharm"
# Messaging
cask "signal"
# Music
cask "spotify"
# Video conferencing
cask "zoom"

# Install apps from the App Store `mas install`
#
# Password manager
mas "Bitwarden", id: 1352778147
# Notes
mas "Bear - Markdown Notes", id: 1091189122
# SVGs
mas "Boxy SVG", id: 611658502
# Browser
mas "DuckDuckGo Privacy Browser", id:663592361
# Window management
mas "Divvy - Window Manager", id: 413857545
# Read later
mas "Instapaper", id: 288545208
mas "Instapaper Save", id: 1481302432
# Team communication
mas "Slack for Desktop", id: 803453959
# Time tracking
mas "Toggle Track: Hours & Time Log", id: 1291898086
# Apple development environment
mas "Xcode", id: 497799835
