# Add extra sources via `brew tap`
# --------------------------------

# Heroku CLI (hosting)
tap "heroku/brew"

# Install via `brew install`
# --------------------------

# `cat` alternative with syntax highlighting
brew "bat"

# Fuzzy finder
brew "fzf"

# Heroku CLI (hosting access)
brew "heroku"

# Version control
brew "git"

# Better diffing
brew "git-delta"

# Node.js version management
brew "nvm"

# Install standalone Python apps
brew "pipx"

# Python version management
brew "pyenv"
brew "pyenv-virtualenv"

# Remote file transfer
brew "rsync"

# File search
brew "the_silver_searcher"

# File editing
brew "vim"

# Install apps via `brew install --cask`
# --------------------------------------

# Automation and text expansion
cask "alfred"

# Keyboard shortcuts and other eutomation
cask "bettertouchtool"

# Database GUI
cask "dbeaver-community"

# Documentation browser
cask "dash"

# Browser
cask "duckduckgo"

# Design
cask "figma"

# Finances
cask "gnucash"

# Dev browser (chromium)
cask "helium-browser"

# iPhone access and backups
cask "imazing"

# Image optization
cask "imageoptim"

# Virtual machines and containers
cask "orbstack"

# Python IDE
cask "pycharm"

# Readwise Reader - Read-it-later app
cask "reader"

# Messaging
cask "signal"

# Music
cask "spotify"

# Web IDE
cask "webstorm"

# Video conferencing
cask "zoom"

# Install apps from the App Store `mas install`
# --------------------------------------------

# Password manager
mas "Bitwarden", id: 1352778147

# Notes
mas "Bear - Markdown Notes", id: 1091189122

# SVGs
mas "Boxy SVG", id: 611658502

# Better date and time display
mas "Dato", id: 1470584107

# Window management
mas "Divvy - Window Manager", id: 413857545

# PDF Reading
mas "Highlights", id: 1498912833

# Team communication
mas "Slack for Desktop", id: 803453959

# Time tracking
mas "Toggle Track: Hours & Time Log", id: 1291898086

# Apple development environment
mas "Xcode", id: 497799835

