tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "snyk/tap"
brew "python@3.9"
brew "awscli"
brew "bat"
brew "pkg-config"
brew "ddrescue"
brew "fabric"
brew "fzf"
brew "git"
brew "git-delta"
brew "libtool"
brew "guile"
brew "unbound"
brew "gnutls"
brew "graphviz"
brew "krb5"
brew "libxml2"
brew "libxmlsec1"
brew "nghttp2"
brew "nvm"
brew "python@3.10"
brew "pipx"
brew "poetry"
brew "postgresql"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "testdisk"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "heroku/brew/heroku"
brew "snyk/tap/snyk"
cask "adobe-acrobat-reader"
cask "anki"
cask "authy"
cask "aws-vault"
cask "bartender"
cask "dbeaver-community"
cask "docker"
cask "figma"
cask "firefox"
cask "flux"
cask "gnucash"
cask "gpg-suite"
cask "imageoptim"
cask "little-snitch"
cask "session-manager-plugin"
cask "signal"
cask "spotify"
cask "timeular"
cask "vagrant"
cask "virtualbox"
cask "vlc"
cask "xbar"
cask "zoom"
mas "Bitwarden", id: 1352778147
mas "Bear - Markdown Notes", id: 1091189122
mas "Instapaper Save", id: 1481302432
mas "Slack", id: 803453959
mas "Harvest", id: 506189836
mas "Magnet", id: 441258766
